class KmxException(Exception):
    """ """


# ----------------------------------------------------------------------------------------------------------------------
# Locker error
# ----------------------------------------------------------------------------------------------------------------------
class LockerError(Exception):
    """ """


class LockTimeout(LockerError):
    """ Истекло время ожидания блокировки """


# ----------------------------------------------------------------------------------------------------------------------
# RPC errors
# ----------------------------------------------------------------------------------------------------------------------
class RpcError(KmxException):
    """ """


class RpcTimeout(RpcError):
    """ """


class RpcBadQuery(RpcError):
    """ """


class RpcIncompatibleParams(RpcError):
    """ """


class RpcRemoteError(RpcError):
    """ """